In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0068001.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(5, 8)

In [7]:
df.head(5)

        0     1            2               3              4   5   6   7
0     NaN   NaN  Hill  1,805  Spencer  2,193  Totals  3,998 NaN NaN NaN
1     NaN   NaN        45.1%           54.9%         100.0% NaN NaN NaN
2  County   PPR          NaN             NaN            NaN NaN NaN NaN
3  CAMDEN  100%         1700            2042           3742 NaN NaN NaN
4   GLYNN  100%          105             151            256 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

        0     1     2     3     4   5   6   7
3  CAMDEN  100%  1700  2042  3742 NaN NaN NaN
4   GLYNN  100%   105   151   256 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

        0     2     3
3  CAMDEN  1700  2042
4   GLYNN   105   151

In [12]:
df.columns = ['county', 'Cecily Hill', 'Jason Spencer']

In [13]:
df.tail(5)

   county Cecily Hill Jason Spencer
3  CAMDEN        1700          2042
4   GLYNN         105           151

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

   county      candidate votes
0  CAMDEN    Cecily Hill  1700
1   GLYNN    Cecily Hill   105
2  CAMDEN  Jason Spencer  2042
3   GLYNN  Jason Spencer   151

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
county       4 non-null object
candidate    4 non-null object
votes        4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [19]:
df['office'] = 'State Representative'

In [20]:
df['district'] = '180'

In [21]:
df['party'] = 'Republican'
# df['party'] = 'Democratic'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Cecily Hill    Republican    1805
Jason Spencer  Republican    2193
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

   county                office district       party      candidate  votes
0  CAMDEN  State Representative      180  Republican    Cecily Hill   1700
1   GLYNN  State Representative      180  Republican    Cecily Hill    105
2  CAMDEN  State Representative      180  Republican  Jason Spencer   2042
3   GLYNN  State Representative      180  Republican  Jason Spencer    151

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')